{
  "language": "React",
  "course": "Hooks",
  "title": "Your First Component",
  "sections": [
    {
      "title": "Components: UI building blocks",
      "content": [
        {
          "type": "text",
          "value": "On the Web, HTML lets us create rich structured documents with its built-in set of tags like <h1> and <li>:"
        },
        {
          "type": "text",
          "value": "This markup represents this article <article>, its heading <h1>, and an (abbreviated) table of contents as an ordered list <ol>. Markup like this, combined with CSS for style, and JavaScript for interactivity, lies behind every sidebar, avatar, modal, dropdown—every piece of UI you see on the Web."
        },
        {
          "type": "text",
          "value": "React lets you combine your markup, CSS, and JavaScript into custom “components”, reusable UI elements for your app. The table of contents code you saw above could be turned into a <TableOfContents /> component you could render on every page. Under the hood, it still uses the same HTML tags like <article>, <h1>, etc."
        },
        {
          "type": "text",
          "value": "Just like with HTML tags, you can compose, order and nest components to design whole pages. For example, the documentation page you’re reading is made out of React components:"
        },
        {
          "type": "text",
          "value": "As your project grows, you will notice that many of your designs can be composed by reusing components you already wrote, speeding up your development. Our table of contents above could be added to any screen with <TableOfContents />! You can even jumpstart your project with the thousands of components shared by the React open source community like Chakra UI and Material UI."
        }
      ]
    },
    {
      "title": "Defining a component",
      "content": [
        {
          "type": "text",
          "value": "Traditionally when creating web pages, web developers marked up their content and then added interaction by sprinkling on some JavaScript. This worked great when interaction was a nice-to-have on the web. Now it is expected for many sites and all apps. React puts interactivity first while still using the same technology: a React component is a JavaScript function that you can sprinkle with markup. Here’s what that looks like (you can edit the example below):"
        }
      ]
    },
    {
      "title": "Using a component",
      "content": [
        {
          "type": "text",
          "value": "Now that you’ve defined your Profile component, you can nest it inside other components. For example, you can export a Gallery component that uses multiple Profile components:"
        }
      ]
    },
    {
      "title": "Recap",
      "content": [
        {
          "type": "text",
          "value": "You’ve just gotten your first taste of React! Let’s recap some key points."
        },
        {
          "type": "list",
          "value": "React lets you create components, reusable UI elements for your app.\n\n\nIn a React app, every piece of UI is a component.\n\n\nReact components are regular JavaScript functions except:\n\nTheir names always begin with a capital letter.\nThey return JSX markup."
        }
      ]
    },
    {
      "title": "Try out some challenges",
      "content": []
    }
  ],
  "source": "https://react.dev"
}